"I have read and agree to the WPS Office License Agreement and the Privacy Policy." = "「利用規約」と「プライバシーポリシー」を確認し、同意します。";

"WPS Office License Agreement" = "利用規約";

"Privacy Policy" = "プライバシーポリシー";

"Download failed, please check the network" = "ダウンロードに失敗しました。ネットワークを確認してください。";

"manual install" = "手動インストール";

"Retry" = "リトライ";

"Install Now" = "今すぐインストール";

"Installation failed, please check if the system has enough memory space." = "インストールに失敗しました。システムに十分なメモリがあるかどうかを確認してください。";

"Installation failed, please close the running WPS Office." = "インストールに失敗しました。実行中のWPS Officeを終了してください。";

"Installing, please wait..." = "WPS Office をダウンロードしています...";

"Language" = "言語";

"All-in-One OfficeSuite with PDFEditor. Now with AI" = "AI搭載オールインワンオフィススイート · プロ級PDF編集機能付き";

"Cancel" = "キャンセル";

"Tip" = "ヒント";

"Confirm" = "確認する";

"In accordance with relevant policy requirements, for a better experience with WPS Office services, please read and agree to the License Agreement and Privacy Policy." = "関連するポリシー要件に従い、WPS Office サービスをより有効に活用するために、利用規約とプライバシーポリシーを読んで同意してください。";

"License Agreement" = "利用規約";

"Create infinite possibilities" = "無限の可能性を創造する";

"Installing WPS Office" = "WPS Office のインストールが進行中です...";

"Before installing, please close the running WPS Office." = "インストールする前に、実行中の WPS Office を閉じてください。";